artillery/outputs/high-load-kotlin.txt
Started phase 0 (Warm up low load), duration: 20s @ 12:05:40(+0100) 2022-12-10
Report @ 12:05:50(+0100) 2022-12-10
Elapsed time: 10 seconds
  Scenarios launched:  99
  Scenarios completed: 99
  Requests completed:  99
  Mean response/sec: 10.01
  Response time (msec):
    min: 14
    max: 52
    median: 30
    p95: 41.6
    p99: 47.6
  Codes:
    200: 99

Report @ 12:06:00(+0100) 2022-12-10
Elapsed time: 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.02
  Response time (msec):
    min: 11
    max: 69
    median: 26.5
    p95: 42.5
    p99: 59
  Codes:
    200: 100

Started phase 1 (Ramp up load), duration: 30s @ 12:06:00(+0100) 2022-12-10
Report @ 12:06:10(+0100) 2022-12-10
Elapsed time: 30 seconds
  Scenarios launched:  134
  Scenarios completed: 134
  Requests completed:  134
  Mean response/sec: 13.41
  Response time (msec):
    min: 13
    max: 61
    median: 23
    p95: 42.8
    p99: 51.8
  Codes:
    200: 134

Report @ 12:06:20(+0100) 2022-12-10
Elapsed time: 40 seconds
  Scenarios launched:  200
  Scenarios completed: 199
  Requests completed:  199
  Mean response/sec: 20.02
  Response time (msec):
    min: 13
    max: 64
    median: 20
    p95: 41
    p99: 48.5
  Codes:
    200: 199

Report @ 12:06:30(+0100) 2022-12-10
Elapsed time: 50 seconds
  Scenarios launched:  273
  Scenarios completed: 273
  Requests completed:  273
  Mean response/sec: 27.58
  Response time (msec):
    min: 12
    max: 44
    median: 20
    p95: 37
    p99: 42.8
  Codes:
    200: 273

Started phase 2 (Sustained load), duration: 60s @ 12:06:30(+0100) 2022-12-10
Report @ 12:06:40(+0100) 2022-12-10
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  596
  Scenarios completed: 596
  Requests completed:  596
  Mean response/sec: 59.66
  Response time (msec):
    min: 11
    max: 38
    median: 12
    p95: 21
    p99: 26
  Codes:
    200: 596

Report @ 12:06:50(+0100) 2022-12-10
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  600
  Scenarios completed: 600
  Requests completed:  600
  Mean response/sec: 60.06
  Response time (msec):
    min: 11
    max: 34
    median: 12
    p95: 21
    p99: 23.5
  Codes:
    200: 600

Report @ 12:07:00(+0100) 2022-12-10
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  600
  Scenarios completed: 600
  Requests completed:  600
  Mean response/sec: 60.06
  Response time (msec):
    min: 11
    max: 46
    median: 12
    p95: 22
    p99: 23.5
  Codes:
    200: 600

Report @ 12:07:10(+0100) 2022-12-10
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  600
  Scenarios completed: 600
  Requests completed:  600
  Mean response/sec: 60.06
  Response time (msec):
    min: 11
    max: 38
    median: 12
    p95: 21
    p99: 24
  Codes:
    200: 600

Report @ 12:07:20(+0100) 2022-12-10
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  600
  Scenarios completed: 600
  Requests completed:  600
  Mean response/sec: 60
  Response time (msec):
    min: 11
    max: 48
    median: 12
    p95: 22
    p99: 24
  Codes:
    200: 600

Report @ 12:07:30(+0100) 2022-12-10
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  600
  Scenarios completed: 600
  Requests completed:  600
  Mean response/sec: 60
  Response time (msec):
    min: 11
    max: 38
    median: 12
    p95: 21
    p99: 24
  Codes:
    200: 600

Report @ 12:07:31(+0100) 2022-12-10
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  7
  Scenarios completed: 8
  Requests completed:  8
  Mean response/sec: 11.67
  Response time (msec):
    min: 11
    max: 16
    median: 14
    p95: 16
    p99: 16
  Codes:
    200: 8

All virtual users finished
Summary report @ 12:07:31(+0100) 2022-12-10
  Scenarios launched:  4409
  Scenarios completed: 4409
  Requests completed:  4409
  Mean response/sec: 39.89
  Response time (msec):
    min: 11
    max: 69
    median: 12
    p95: 33
    p99: 41
  Scenario counts:
    Search words 'at': 1117 (25.335%)
    Search words 'in': 1106 (25.085%)
    Search words 'of': 1075 (24.382%)
    Search words 'Bilbo': 1111 (25.198%)
  Codes:
    200: 4409

Log file: artillery/results/high-load-kotlin.json